
INSERT INTO `r_user` VALUES ('2', '。', '123', '0','http://b.hiphotos.baidu.com/image/pic/item/4034970a304e251f54c022fea486c9177f3e5385.jpg', 'Tom', '','');
INSERT INTO `r_user` VALUES ('3', '1', '1', '0', 'http://c.hiphotos.baidu.com/image/pic/item/8cb1cb13495409237777a2789158d109b3de499e.jpg', 'raincent','649996269@qq.com','');
INSERT INTO `r_user` VALUES ('4', '123', '123', '0','http://c.hiphotos.baidu.com/image/pic/item/a1ec08fa513d2697abfd005a56fbb2fb4316d88f.jpg', 'Sara', '','');
INSERT INTO `r_user` VALUES ('5', '1234', '1234', '0',  'http://e.hiphotos.baidu.com/image/pic/item/962bd40735fae6cd77074a670cb30f2442a70f00.jpg', '鳄鱼','','');
INSERT INTO `r_user` VALUES ('6', '12345', '12345', '0',  'http://d.hiphotos.baidu.com/image/pic/item/730e0cf3d7ca7bcb59c51e29bd096b63f624a87e.jpg', '王思聪','','');
INSERT INTO `r_user` VALUES ('7', '11', '11', '0', 'http://c.hiphotos.baidu.com/image/pic/item/500fd9f9d72a60597f8f271c2b34349b033bba1d.jpg', '老吴','','');
INSERT INTO `r_user` VALUES ('8', '111', '111', '0',  'http://e.hiphotos.baidu.com/image/pic/item/562c11dfa9ec8a13371ab1e6f403918fa0ecc0b0.jpg', '马云', '','');
INSERT INTO `r_user` VALUES ('9', '1111', '1111', '0',  'http://g.hiphotos.baidu.com/image/pic/item/91529822720e0cf3119d0cfc0946f21fbe09aa4b.jpg', '刘强东','','');


INSERT INTO `r_question` VALUES ('1', '请问下各位大侠，
局部稠密与全局稀疏，大量显式与丰富隐式，多元多变与异质异性
这三个特性应该怎么理解呀？ ', '2', '2', '2015-01-27 14:52:38', '2', '');
INSERT INTO `r_question` VALUES ('2', '问一下 如果我以后想在大数据方面发展 我应该怎么选工作 就是所谓的入行？
请大家指点~全', '4', '2', '2015-01-27 12:52:38', '3', '');
INSERT INTO `r_question` VALUES ('3', '数据挖掘有哪些常用的方法？', '2', '3', '2015-01-28 12:52:38', '3', '');
INSERT INTO `r_question` VALUES ('4', '
大家说说数据分析师一般都会用到那些软件呢？', '0', '3', '2015-01-28 12:52:38', '2', '');
INSERT INTO `r_question` VALUES ('5', '
求解 hadoop1.0.4+hbase 0.94.15 读数据出问题，求解！！！', '0', '3', '2015-01-28 12:52:38', '2', '');
INSERT INTO `r_question` VALUES ('6', '
现在考虑的是hadoop，知道hadoop是专为大文件设计的，但是没有别的办法。
希望吧主给点资料学习下吧', '0', '3', '2015-01-28 12:52:38', '2', '');
INSERT INTO `r_question` VALUES ('7', '企业如何更好地制定大数据策略', '0', '2', '2015-01-27 12:52:38', '3', '');
INSERT INTO `r_question` VALUES ('8', '为什么余额宝不是金融寄生虫，而是金融改革急先锋', '0', '2', '2015-01-27 12:52:38', '2', '');
INSERT INTO `r_question` VALUES ('9', '甲骨文发布大数据一体机编码工具', '2', '2', '2015-01-27 12:52:38', '3', '');
INSERT INTO `r_question` VALUES ('10', '求教：物联网、云计算以后，下一个时代会是什么？', '0', '1', '2015-01-27 12:52:38', '3', '');
INSERT INTO `r_question` VALUES ('11', '
使用哪些“教科书式的方法”，使用哪些工具，以什么样的方式，从哪些方面着手收集数据，去分析一个行业的历史，现状，以及发展前景，才能够更全面的了解这个行业？', '2', '1', '2015-01-27 14:52:38', '4', 'http://www.bigdatas.cn/data/attachment/forum/201310/18/204348cdtflk320hg0mzkl.jpg');
INSERT INTO `r_question` VALUES ('12', '
过去几年来，开源技术 Apache Hadoop 在 BI 和数据仓库专业人士当中已经变得相当流行。在本篇教程中，我们将通过回答一些关于 Hadoop 的常见问题来解释它的概念。
什么是 Apache Hadoop？', '2', '1', '2015-01-27 14:52:38', '5', '');
INSERT INTO `r_question` VALUES ('13', '企业选择 Hadoop 有何挑战？', '3', '1', '2015-01-27 14:52:38', '6', '');
INSERT INTO `r_question` VALUES ('14', '大数据，概念诞生已久，而时下大热，似有颠覆现有世界之势。随着现实世界逐步被数字化，辅以层出不穷的新的技术手段和应用，大数据在悄无声息的源源不断的产生，积累，关联，发酵，于是乎，一个崭新的时代蕴育而出。', '2', '1', '2015-01-27 14:52:38', '5', '');
INSERT INTO `r_question` VALUES ('15', '大数据资源有哪些？', '0', '1', '2015-01-27 14:52:38', '6', '');
INSERT INTO `r_question` VALUES ('16', '大数据资源有哪些？比如Data.gov，data.un.org/，data.worldbank.org/，还有哪些？', '0', '1', '2015-01-27 14:52:38', '5', '');
INSERT INTO `r_question` VALUES ('17', '大家知道有哪些做的比较好的做大数据分析的国内公司吗？谢谢', '0', '1', '2015-01-27 14:52:38', '3', '');
INSERT INTO `r_question` VALUES ('18', '不知道您说的是全国呢？还是北京呢？', '0', '1', '2015-01-27 14:52:38', '2', '');
INSERT INTO `r_question` VALUES ('19', '
国内应该有一些从事这方面的企业吧，我期望能找到一些北京这方面的企业，尤其是大数据分析', '0', '1', '2015-01-27 14:52:38', '6', '');
INSERT INTO `r_question` VALUES ('20', '国内的还真没有发现比较好的，应该方面有很大的市场啊！', '0', '1', '2015-01-27 14:52:38', '3', '');
INSERT INTO `r_question` VALUES ('21', '当数据工程师说起一个新点子,你有7个问题可以问', '0', '1', '2015-01-27 14:52:38', '6', '');


INSERT INTO `r_comment` VALUES ('1', '1', '2', '2015-01-27 14:52:38', '上海市', '
总结的牛逼啊，真是高手！', '', '0');
INSERT INTO `r_comment` VALUES ('2', '1', '3', '2015-01-17 14:52:38', '江苏连云港', '
局部稠密与全局稀疏   
认为这句的意思应该说的是大数据的相关性特点吧，不同维度之间的关系不明显，所以说全局稀疏，个人看法，你们认为呢？', '', '');
INSERT INTO `r_comment` VALUES ('3', '2', '3', '2015-01-18 14:52:38', '江苏省南京市', '
大数据目前还处于初级阶段吧，选择具体的工作岗位真是一件麻烦的事情', '', '3');
INSERT INTO `r_comment` VALUES ('4', '2', '3', '2015-01-20 14:52:38', '上海市', '
还是先看看书吧，大家都搞不清楚，也没人指点我', '', '0');
INSERT INTO `r_comment` VALUES ('5', '2', '2', '2015-01-21 14:52:38', '上海市', '
好多朋友问这个问题。
问这个问题的朋友有一些是从事IT行业多年的，更多的是一些江湖小白，对于这个问题，我发表一下个人的看法，不妥支持欢迎大家指正。

首先，入行之前应该先了解大数据是什么？
个人认为大数据不是一个独门别类的技术，不是认准一本书、一堂课学了就完事，我们都知道，大数据是一种适应时代发展的数据处理思维和概念。大数据设计的面很广，比如：数据可视化、超大规模数据存储、超大规模数据处理、大数据分析等等，不但包括了软件，还设计到硬件的配置，比如使用hadoop做服务器数据架构管理、用sas、sass做大数据的分析处理，等等吧。
其中每一个小的部分都需要人去做，而且每一个都有很大的发展空间；
其中软件需要的是可视化、编程序（编程和大数据相关就是大数据哦），硬件相关我们可以搞搞云存储、搞搞hadoop，另外和大数据相关的实在是太多，不要局限于非得做啥，只要有门道我们就要把握好，慢慢的就摸清了！', '', '0');
INSERT INTO `r_comment` VALUES ('6', '2', '3', '2015-01-22 14:52:38', '江苏南京', '
还是选择方向吧，缩小一下选择范围，或许会好一些，好多朋友都在问这个问题，确实难以回答~', null, '0');

INSERT INTO `r_comment` VALUES ('7', '3', '2', '2015-01-27 14:52:38', '上海市', '
回归分析，分类分析，相关性分析，聚类分析，判别分析，主成分分析，因子分析，时间序列分析', '', '0');
INSERT INTO `r_comment` VALUES ('8', '3', '2', '2015-01-27 14:52:38', '上海市', '
精华帖，顶一个！', '', '0');


INSERT INTO `r_comment` VALUES ('9', '9', '2', '2015-01-27 14:52:38', '上海市', 'Excel ：

Microsoft Excel 是微软公司的办公软件 Microsoft office 的组件之一，是由 Microsoft 为 Windows 和 Apple Macintosh 操作系统的电脑而编写和运行的一款试算表软件。 Excel 是微软办公套装软件的一个重要的组成部分，它可以进行各种数据的处理、统计分析和辅助决策操作，广泛地应用于管理、统计财经、金融等众多领域。功能强大，益于学生学习，通常情况下，功能完全可以满足用户的需求；', '', '0');
INSERT INTO `r_comment` VALUES ('10', '9', '2', '2015-01-27 14:52:38', '上海市', '
Matlab ：

Matlab 是矩阵实验室（ Matrix Laboratory ）的简称，是美国 MathWorks 公司出品的商业数学软件，用于算法开发、数据可视化、数据分析以及数值计算的高级技术计算语言和交互式环境，主要包括 MATLAB 和 Simulink 两大部分。', '', '0');

INSERT INTO `r_comment` VALUES ('11', '11', '4', '2015-01-27 14:52:38', '上海市', '
恐怕我给出的不是 “教科书式的方法”。恰恰相反，我认为“外行”（在此行业时间较短）分析一个行业用数据会很成问题。
1. 中国的行业数据太少、太糙，鱼目混杂。涉及到企业形象、行业地位、广告主、客户等数据几乎没真的……
2. 摆脱数据，找行业资深人士资讯，效果会事半功倍。当然，别听一家之言。让行业人士量化打分也是个不错的选择。
3. 这样做下来你已经发现很多这个行业的核心方向了，针对有争议的部分可以再做第二轮访谈。
4. 初期的消费者调研仅在最基础的问题有意义，因为你很难问出到位的问题，并且很容易理解偏差。所以只问最最基础的问题即可。
5. 访谈完成后，找到关键点，可以适当补充消费者调研。
最终，切记：数据只是结果，原因更重要。', '', '0');
INSERT INTO `r_comment` VALUES ('12', '11', '4', '2015-01-27 14:52:38', '上海市', '
首先,先要了解一下这个调查的意义是什么,产业分析的目的是了解产业发展的各种宏观和微观的条件和变化,从而推导出产业未来的趋势和变化.
那么针对这2两个分析的方向,
在宏观方面,常用的是PEST分析法(政治Political、经济Economic、社会文化 Socio-cultural、科技Technological),也有扩展为PESTLE法的(加入法律 Legal、环境Environmental).这些都是比较宏观的. 这些研究是有一个具体的学科的,叫做 business environment. 基本上整个产业的所处的一切条件都是分析的基础.
在微观的方面, 往往是在以一个具体的企业为切入点, 将具体的企业作为范例来对照产业中的各种情况,将企业本身的发展与产业的发展结合在一起关注, 则会使用一些SWOT的模型.
还有一个综合的常用模型是Porter’s five forces analysis. 但是我觉得这个模型有几个缺陷, 第一,内外部的元素混杂在一起,思路不太清晰. 第二,这个模型是1979年的模块,划分的非常粗略,很多信息无法归类. 第三,比较缺乏对于经济环境的归类,条件分析不足. 第四,此模型在具体分析产业中的某一企业更为适用.建立的初衷也在于此.
PS:这3个模式,网上已经说得很具体了,我就不累述了.', '', '0');

INSERT INTO `r_comment` VALUES ('13', '12', '5', '2015-01-27 14:52:38', '上海市', 'Apache Hadoop 是一款免费的，基于 Java 的编程框架，专为分布式计算环境下的超大数据量并行处理而设计。Hadoop 支持以容错方式扩展，可以从一台计算机扩展到数千台。这种扩展性意味着处理集群中的个体计算机可以是比较廉价的，而集群本身也很有弹性。有了 Hadoop，应用程序可以在成千上万个处理节点上处理 PB 级的数据量。
谁为 Hadoop 提供支持和资金呢？', '', '0');
INSERT INTO `r_comment` VALUES ('14', '12', '4', '2015-01-27 14:52:38', '上海市', 'Hadoop 之所以流行，部分原因是因为世界上最大的互联网企业都在用它来分析非结构化数据，这是不争的事实。Hadoop 支持分布式应用处理数千 EB 的数据。
Hadoop 适用于哪些业务场景？', '', '0');

INSERT INTO `r_comment` VALUES ('15', '13', '2', '2015-01-27 14:52:38', '上海市', '对许多企业来说，Hadoop 框架很有吸引力，因为它给企业提供了分析数据的能力，不管数据量有多大。然而，不是所有企业都拥有专业能力来进行分析并产生商业价值的。', '', '0');
INSERT INTO `r_comment` VALUES ('16', '13', '3', '2015-01-27 14:52:38', '上海市', '扩展和优化的 Hadoop 计算集群涉及大量编程工作，这对数据分析开发人员来说可能会有一定的障碍。', '', '0');
INSERT INTO `r_comment` VALUES ('17', '13', '4', '2015-01-27 14:52:38', '上海市', 'Hadoop 的设计原本并不具备太多安全功能，而这一点对于敏感企业数据通常也是必须要求的。', '', '0');


INSERT INTO `r_comment` VALUES ('18', '14', '6', '2015-01-27 14:52:38', '上海市', '在企业的日常运营中，通过大数据的帮助可改变公司的决策机制和流程。通常情况下公司的决策都会由领导层面少数人掌握，主要靠的是过往经验和判断，而有了大数据支持，只要懂得解读数据的含义，任何执行层面的员工就可以根据数据和程序作出必要的决策，从而提高了决策效率。', '', '0');
INSERT INTO `r_comment` VALUES ('19', '14', '3', '2015-01-27 14:52:38', '上海市', '通常认为大数据首先影响到的行业会是电信，金融，网络，政府等行业和领域，这些领域的确是已有大量的数据资源，但如何利用好这些数据资源，对于这些领域的企业却是个棘手的问题，大数据思维欠缺，数据技术人员储备不够，又做不到开放数据给第三方，于是导致了这些领域反而对大数据的利用度不够，坐拥金矿却无法有效开采，从而也无法享受到大数据所带来的好处。反而是一些相对传统的领域和市场化程度更高，用户人群特性更集中和明显的领域更容易接受大数据的变革。', '', '0');


